content/post/20230802235659-useful_programs.md
+++
title = "useful programs"
author = ["The primary user account"]
lastmod = 2024-10-19T23:16:58+02:00
draft = false
+++

## Command line video/audio splitter {#command-line-video-audio-splitter}

<https://github.com/c0decracker/video-splitter>


## screenshots/gifs {#screenshots-gifs}

<https://flameshot.org/>
<https://github.com/phw/peek>


## cli {#cli}


### nmcli {#nmcli}

cli for networkmanager

```sh
nmcli device wifi list
```


## Asciinema {#asciinema}

The following commands are used to build a recording:

```sh

# Install asciinema:
apt-get install asciinema
# Setup a window:
printf '\e[8;26;100t' # set window size to 100x26
tmux new-session -s preso
PS1='\n\$ ' # minimal prompt
# After windows are setup, detach from tmux (Ctrl-B D)
# Create a recording:
asciinema rec name.cast -i 3 -c "tmux attach -t preso"
# Stop the recording by detaching (Ctrl-B D)
# Tip: Edit the recording to remove the last few milliseconds of the detach
# Replay the recording:
asciinema play name.cast
```
